{
  "designGuidelines": [
    "Use the golden ratio (1:1.618) to determine proportions of content and sidebars. For example, a 960 px wide layout should allocate about 593 px for content and 367 px for the sidebar【624131682342355†L294-L297】.",
    "Balance text-heavy content by placing images, text blocks and buttons in golden rectangles. This creates a classical, balanced interface and feels familiar to users【334394252146945†L93-L109】.",
    "Apply Hick’s law: reduce the number of choices on any page so decisions are easy. Too many options slow down user decisions and hurt usability【624131682342355†L304-L317】.",
    "Follow Fitts’s law: important buttons (e.g., call‑to‑action) should be large and close to where users are focusing. Larger and closer targets are easier to click【624131682342355†L330-L351】.",
    "Use visual hierarchy: rank elements based on importance. Larger size, contrasting colors, and positioning draw attention first【624131682342355†L215-L255】.",
    "Implement Gestalt principles: group related elements together (law of proximity), make similar elements look alike (similarity), and ensure the overall layout is perceived as a whole before its parts【624131682342355†L386-L413】.",
    "Use the rule of thirds for images: divide images into nine equal rectangles and place focal points at the intersections for more engaging composition【624131682342355†L366-L381】.",
    "Consider typography using the golden ratio: multiply the body font size by 1.618 to get a harmonious heading size (e.g., a 10 pt body text pairs well with a 16 pt heading)【334394252146945†L170-L176】.",
    "Start mobile‑first and ensure responsive design across devices【898852409851329†L153-L158】.",
    "Be specific in prompts: describe exactly what needs fixing or updating rather than vague statements to help the AI produce accurate changes【898852409851329†L127-L133】.",
    "Create a knowledge base for each project: specify goals, features, tech stack, in‑scope vs out‑of‑scope, UX flow, and visual rules; ask the AI to review it before starting【898852409851329†L95-L106】."
  ]
}